cheatsheets/gmail_shortcuts-cheatsheet.org
:PROPERTIES:
:ID:       fc025c6b-eac4-453d-b1f6-8d8331da1de2
:END:
#+TITLE: GMail: Shortcuts Cheatsheet
#+CATEGORY: slips
#+TAGS:

* Keybinds

These are in Emacs notation, except where Mac specific. Shortcuts where two keys
are hit in succession are concatenated: =*a= instead of =*-a=

+ C :: Control
+ M :: Alt
+ S :: Shift
+ s :: super

On Mac, control shortcuts use the Mac-style Super key =⌘= instead, since Mac
gives a handful of Emacs shortcuts like =C-a= and =C-e= in most native
interfaces.

** Compose & chat

|------------------------------------------+----------|
| Action                                   | Shortcut |
|------------------------------------------+----------|
| Previous message in an open conversation | *p*      |
| Next message in an open conversation     | *n*      |
| Focus main window                        | *S-ESC*  |
| Focus latest chat or compose             | *ESC*    |
| Advance to the next chat or compose      | *C-.*    |
| Advance to previous chat or compose      | *C-,*    |
| Send                                     | *C-RET*  |
| Add cc recipients                        | *C-S-c*  |
| Add bcc recipients                       | *C-S-b*  |
| Access custom from                       | *C-S-f*  |
| Insert a link                            | *C-k*    |
| Go to next misspelled word (Mac only)    | *⌘-;*    |
| Open spelling suggestions                | *C-m*    |
|------------------------------------------+----------|

** Formatting text

|--------------------+----------|
| Action             | Shortcut |
|--------------------+----------|
| Previous font      | *C-S-5*  |
| Next font          | *C-S-6*  |
| Decrease text size | *C-S--*  |
| Increase text size | *C-S-+*  |
| Bold               | *C-b*    |
| Italics            | *C-i*    |
| Underline          | *C-u*    |
| Numbered list      | *C-S-7*  |
| Bulleted list      | *C-S-8*  |
| Quote              | *C-S-9*  |
| Indent less        | *C-[*    |
| Indent more        | *C-]*    |
| Align left         | *C-S-l*  |
| Align center       | *C-S-e*  |
| Align right        | *C-S-r*  |
| Remove formatting  | *C-\*    |
|--------------------+----------|

** Actions

|-------------------------------------------+------------|
| Action                                    | Shortcut   |
|-------------------------------------------+------------|
| Move focus to toolbar                     | *,*        |
| Select conversation                       | *x*        |
| Toggle star/rotate among superstars       | *s*        |
| Archive                                   | *e*        |
| Mute conversation                         | *m*        |
| Report as spam                            | *!*        |
| Delete                                    | *#*        |
| Reply                                     | *r*        |
| Reply in a new window                     | *S-r*      |
| Reply all                                 | *a*        |
| Reply all in a new window                 | *S-a*      |
| Forward                                   | *f*        |
| Forward in a new window                   | *S-f*      |
| Update conversation                       | *S-n*      |
| Archive conversation and go previous/next | *] or [*   |
| Undo last action                          | *z*        |
| Mark as read                              | *S-i*      |
| Mark as unread                            | *S-u*      |
| Mark unread from the selected message     | *_*        |
| Mark as important                         | *+* or *=* |
| Mark as not important                     | *-*        |
| Snooze (not available in classic Gmail)   | *b*        |
| Expand entire conversation                | *;*        |
| Collapse entire conversation              | *:*        |
| Add conversation to Tasks                 | *S-t*      |
|-------------------------------------------+------------|

** Jumping


|---------------------------------------------+-------------------|
| Action                                      | Shortcut          |
|---------------------------------------------+-------------------|
| Go to Inbox                                 | *g* + *i*         |
| Go to Starred conversations                 | *g* + *s*         |
| Go to Snoozed conversations                 | *g + b*           |
| Go to Sent messages                         | *g* + *t*         |
| Go to Drafts                                | *g* + *d*         |
| Go to All mail                              | *g* + *a*         |
| Toggle focus: Inbox and Calendar/Keep/Tasks | *C-M-,*or *C-M-.* |
| Go to Tasks                                 | *g* + *k*         |
| Go to label                                 | *g* + *l*         |
|---------------------------------------------+-------------------|

The "toggle focus" doesn't work for me.

** Threadlist selection


|--------------------------------+----------|
| Action                         | Shortcut |
|--------------------------------+----------|
| Select all conversations       | **a*     |
| Deselect all conversations     | **n*     |
| Select read conversations      | **r*     |
| Select unread conversations    | **u*     |
| Select starred conversations   | **s*     |
| Select unstarred conversations | **t*     |
|--------------------------------+----------|

** Navigation

|------------------------------+--------------|
| Action                       | Shortcut     |
|------------------------------+--------------|
| Go to next page              | *g + n*      |
| Go to previous page          | *g + p*      |
| Back to threadlist           | *u*          |
| Newer conversation           | *k*          |
| Older conversation           | *j*          |
| Open conversation            | *o* or *RET* |
| Go to next Inbox section     | *`*          |
| Go to previous Inbox section | *~*          |
|------------------------------+--------------|

** Application


|-----------------------------+----------|
| Action                      | Shortcut |
|-----------------------------+----------|
| Compose                     | *c*      |
| Compose in a new tab        | *d*      |
| Search mail                 | */*      |
| Search chat contacts        | *q*      |
| Open "more actions" menu    | *.*      |
| Open "move to" menu         | *v*      |
| Open "label as" menu        | *l*      |
| Open keyboard shortcut help | *?*      |
|-----------------------------+----------|

* Roam
+ [[id:844c1801-23e1-4229-9447-e0e396a576f1][Email]]
