cheatsheets/gmail_shortcuts-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-02 Mon 15:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GMail: Shortcuts Cheatsheet</title>
<meta name="author" content="David Conner" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">GMail: Shortcuts Cheatsheet</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfee6057">1. Keybinds</a>
<ul>
<li><a href="#org91055a8">1.1. Compose &amp; chat</a></li>
<li><a href="#orgc620a77">1.2. Formatting text</a></li>
<li><a href="#orgae011d7">1.3. Actions</a></li>
<li><a href="#orga756157">1.4. Jumping</a></li>
<li><a href="#org560de16">1.5. Threadlist selection</a></li>
<li><a href="#org3de6c19">1.6. Navigation</a></li>
<li><a href="#org5e24060">1.7. Application</a></li>
</ul>
</li>
<li><a href="#org006f4b4">2. Roam</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfee6057" class="outline-2">
<h2 id="orgfee6057"><span class="section-number-2">1.</span> Keybinds</h2>
<div class="outline-text-2" id="text-1">
<p>
These are in Emacs notation, except where Mac specific. Shortcuts where two keys
are hit in succession are concatenated: <code>*a</code> instead of <code>*-a</code>
</p>

<dl class="org-dl">
<dt>C</dt><dd>Control</dd>
<dt>M</dt><dd>Alt</dd>
<dt>S</dt><dd>Shift</dd>
<dt>s</dt><dd>super</dd>
</dl>

<p>
On Mac, control shortcuts use the Mac-style Super key <code>⌘</code> instead, since Mac
gives a handful of Emacs shortcuts like <code>C-a</code> and <code>C-e</code> in most native
interfaces.
</p>
</div>

<div id="outline-container-org91055a8" class="outline-3">
<h3 id="org91055a8"><span class="section-number-3">1.1.</span> Compose &amp; chat</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Previous message in an open conversation</td>
<td class="org-left"><b>p</b></td>
</tr>

<tr>
<td class="org-left">Next message in an open conversation</td>
<td class="org-left"><b>n</b></td>
</tr>

<tr>
<td class="org-left">Focus main window</td>
<td class="org-left"><b>S-ESC</b></td>
</tr>

<tr>
<td class="org-left">Focus latest chat or compose</td>
<td class="org-left"><b>ESC</b></td>
</tr>

<tr>
<td class="org-left">Advance to the next chat or compose</td>
<td class="org-left"><b>C-.</b></td>
</tr>

<tr>
<td class="org-left">Advance to previous chat or compose</td>
<td class="org-left"><b>C-,</b></td>
</tr>

<tr>
<td class="org-left">Send</td>
<td class="org-left"><b>C-RET</b></td>
</tr>

<tr>
<td class="org-left">Add cc recipients</td>
<td class="org-left"><b>C-S-c</b></td>
</tr>

<tr>
<td class="org-left">Add bcc recipients</td>
<td class="org-left"><b>C-S-b</b></td>
</tr>

<tr>
<td class="org-left">Access custom from</td>
<td class="org-left"><b>C-S-f</b></td>
</tr>

<tr>
<td class="org-left">Insert a link</td>
<td class="org-left"><b>C-k</b></td>
</tr>

<tr>
<td class="org-left">Go to next misspelled word (Mac only)</td>
<td class="org-left"><b>⌘-;</b></td>
</tr>

<tr>
<td class="org-left">Open spelling suggestions</td>
<td class="org-left"><b>C-m</b></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc620a77" class="outline-3">
<h3 id="orgc620a77"><span class="section-number-3">1.2.</span> Formatting text</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Previous font</td>
<td class="org-left"><b>C-S-5</b></td>
</tr>

<tr>
<td class="org-left">Next font</td>
<td class="org-left"><b>C-S-6</b></td>
</tr>

<tr>
<td class="org-left">Decrease text size</td>
<td class="org-left"><b>C-S--</b></td>
</tr>

<tr>
<td class="org-left">Increase text size</td>
<td class="org-left"><b>C-S-+</b></td>
</tr>

<tr>
<td class="org-left">Bold</td>
<td class="org-left"><b>C-b</b></td>
</tr>

<tr>
<td class="org-left">Italics</td>
<td class="org-left"><b>C-i</b></td>
</tr>

<tr>
<td class="org-left">Underline</td>
<td class="org-left"><b>C-u</b></td>
</tr>

<tr>
<td class="org-left">Numbered list</td>
<td class="org-left"><b>C-S-7</b></td>
</tr>

<tr>
<td class="org-left">Bulleted list</td>
<td class="org-left"><b>C-S-8</b></td>
</tr>

<tr>
<td class="org-left">Quote</td>
<td class="org-left"><b>C-S-9</b></td>
</tr>

<tr>
<td class="org-left">Indent less</td>
<td class="org-left"><b>C-[</b></td>
</tr>

<tr>
<td class="org-left">Indent more</td>
<td class="org-left"><b>C-]</b></td>
</tr>

<tr>
<td class="org-left">Align left</td>
<td class="org-left"><b>C-S-l</b></td>
</tr>

<tr>
<td class="org-left">Align center</td>
<td class="org-left"><b>C-S-e</b></td>
</tr>

<tr>
<td class="org-left">Align right</td>
<td class="org-left"><b>C-S-r</b></td>
</tr>

<tr>
<td class="org-left">Remove formatting</td>
<td class="org-left"><b>C-\</b></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgae011d7" class="outline-3">
<h3 id="orgae011d7"><span class="section-number-3">1.3.</span> Actions</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Move focus to toolbar</td>
<td class="org-left"><b>,</b></td>
</tr>

<tr>
<td class="org-left">Select conversation</td>
<td class="org-left"><b>x</b></td>
</tr>

<tr>
<td class="org-left">Toggle star/rotate among superstars</td>
<td class="org-left"><b>s</b></td>
</tr>

<tr>
<td class="org-left">Archive</td>
<td class="org-left"><b>e</b></td>
</tr>

<tr>
<td class="org-left">Mute conversation</td>
<td class="org-left"><b>m</b></td>
</tr>

<tr>
<td class="org-left">Report as spam</td>
<td class="org-left"><b>!</b></td>
</tr>

<tr>
<td class="org-left">Delete</td>
<td class="org-left"><b>#</b></td>
</tr>

<tr>
<td class="org-left">Reply</td>
<td class="org-left"><b>r</b></td>
</tr>

<tr>
<td class="org-left">Reply in a new window</td>
<td class="org-left"><b>S-r</b></td>
</tr>

<tr>
<td class="org-left">Reply all</td>
<td class="org-left"><b>a</b></td>
</tr>

<tr>
<td class="org-left">Reply all in a new window</td>
<td class="org-left"><b>S-a</b></td>
</tr>

<tr>
<td class="org-left">Forward</td>
<td class="org-left"><b>f</b></td>
</tr>

<tr>
<td class="org-left">Forward in a new window</td>
<td class="org-left"><b>S-f</b></td>
</tr>

<tr>
<td class="org-left">Update conversation</td>
<td class="org-left"><b>S-n</b></td>
</tr>

<tr>
<td class="org-left">Archive conversation and go previous/next</td>
<td class="org-left"><b>] or [</b></td>
</tr>

<tr>
<td class="org-left">Undo last action</td>
<td class="org-left"><b>z</b></td>
</tr>

<tr>
<td class="org-left">Mark as read</td>
<td class="org-left"><b>S-i</b></td>
</tr>

<tr>
<td class="org-left">Mark as unread</td>
<td class="org-left"><b>S-u</b></td>
</tr>

<tr>
<td class="org-left">Mark unread from the selected message</td>
<td class="org-left"><b>_</b></td>
</tr>

<tr>
<td class="org-left">Mark as important</td>
<td class="org-left"><b>+</b> or <b>=</b></td>
</tr>

<tr>
<td class="org-left">Mark as not important</td>
<td class="org-left"><b>-</b></td>
</tr>

<tr>
<td class="org-left">Snooze (not available in classic Gmail)</td>
<td class="org-left"><b>b</b></td>
</tr>

<tr>
<td class="org-left">Expand entire conversation</td>
<td class="org-left"><b>;</b></td>
</tr>

<tr>
<td class="org-left">Collapse entire conversation</td>
<td class="org-left"><b>:</b></td>
</tr>

<tr>
<td class="org-left">Add conversation to Tasks</td>
<td class="org-left"><b>S-t</b></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga756157" class="outline-3">
<h3 id="orga756157"><span class="section-number-3">1.4.</span> Jumping</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Go to Inbox</td>
<td class="org-left"><b>g</b> + <b>i</b></td>
</tr>

<tr>
<td class="org-left">Go to Starred conversations</td>
<td class="org-left"><b>g</b> + <b>s</b></td>
</tr>

<tr>
<td class="org-left">Go to Snoozed conversations</td>
<td class="org-left"><b>g + b</b></td>
</tr>

<tr>
<td class="org-left">Go to Sent messages</td>
<td class="org-left"><b>g</b> + <b>t</b></td>
</tr>

<tr>
<td class="org-left">Go to Drafts</td>
<td class="org-left"><b>g</b> + <b>d</b></td>
</tr>

<tr>
<td class="org-left">Go to All mail</td>
<td class="org-left"><b>g</b> + <b>a</b></td>
</tr>

<tr>
<td class="org-left">Toggle focus: Inbox and Calendar/Keep/Tasks</td>
<td class="org-left"><b>C-M-,*or *C-M-.</b></td>
</tr>

<tr>
<td class="org-left">Go to Tasks</td>
<td class="org-left"><b>g</b> + <b>k</b></td>
</tr>

<tr>
<td class="org-left">Go to label</td>
<td class="org-left"><b>g</b> + <b>l</b></td>
</tr>
</tbody>
</table>

<p>
The "toggle focus" doesn't work for me.
</p>
</div>
</div>

<div id="outline-container-org560de16" class="outline-3">
<h3 id="org560de16"><span class="section-number-3">1.5.</span> Threadlist selection</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Select all conversations</td>
<td class="org-left"><b>*a</b></td>
</tr>

<tr>
<td class="org-left">Deselect all conversations</td>
<td class="org-left"><b>*n</b></td>
</tr>

<tr>
<td class="org-left">Select read conversations</td>
<td class="org-left"><b>*r</b></td>
</tr>

<tr>
<td class="org-left">Select unread conversations</td>
<td class="org-left"><b>*u</b></td>
</tr>

<tr>
<td class="org-left">Select starred conversations</td>
<td class="org-left"><b>*s</b></td>
</tr>

<tr>
<td class="org-left">Select unstarred conversations</td>
<td class="org-left"><b>*t</b></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3de6c19" class="outline-3">
<h3 id="org3de6c19"><span class="section-number-3">1.6.</span> Navigation</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Go to next page</td>
<td class="org-left"><b>g + n</b></td>
</tr>

<tr>
<td class="org-left">Go to previous page</td>
<td class="org-left"><b>g + p</b></td>
</tr>

<tr>
<td class="org-left">Back to threadlist</td>
<td class="org-left"><b>u</b></td>
</tr>

<tr>
<td class="org-left">Newer conversation</td>
<td class="org-left"><b>k</b></td>
</tr>

<tr>
<td class="org-left">Older conversation</td>
<td class="org-left"><b>j</b></td>
</tr>

<tr>
<td class="org-left">Open conversation</td>
<td class="org-left"><b>o</b> or <b>RET</b></td>
</tr>

<tr>
<td class="org-left">Go to next Inbox section</td>
<td class="org-left"><b>`</b></td>
</tr>

<tr>
<td class="org-left">Go to previous Inbox section</td>
<td class="org-left"><b>~</b></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5e24060" class="outline-3">
<h3 id="org5e24060"><span class="section-number-3">1.7.</span> Application</h3>
<div class="outline-text-3" id="text-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Shortcut</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Compose</td>
<td class="org-left"><b>c</b></td>
</tr>

<tr>
<td class="org-left">Compose in a new tab</td>
<td class="org-left"><b>d</b></td>
</tr>

<tr>
<td class="org-left">Search mail</td>
<td class="org-left"><b>/</b></td>
</tr>

<tr>
<td class="org-left">Search chat contacts</td>
<td class="org-left"><b>q</b></td>
</tr>

<tr>
<td class="org-left">Open "more actions" menu</td>
<td class="org-left"><b>.</b></td>
</tr>

<tr>
<td class="org-left">Open "move to" menu</td>
<td class="org-left"><b>v</b></td>
</tr>

<tr>
<td class="org-left">Open "label as" menu</td>
<td class="org-left"><b>l</b></td>
</tr>

<tr>
<td class="org-left">Open keyboard shortcut help</td>
<td class="org-left"><b>?</b></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org006f4b4" class="outline-2">
<h2 id="org006f4b4"><span class="section-number-2">2.</span> Roam</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="../topics/email.html#ID-844c1801-23e1-4229-9447-e0e396a576f1">Email</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Conner</p>
<p class="date">Created: 2023-10-02 Mon 15:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>